iPhone 11 Pro Max - это самый крупный iPhone в 2019 году. Благодаря диагонали в 6.5 дюймов, 
выросло не только удобство использования и информативность, но и ёмкость аккумулятора, 
что в сочетании с энергоэффективным и мощным процессором Apple A13 Bionic, 
позволяет смартфону работать 1,5-2 дня или 1 день стабильно при высокой нагрузке. 
Но смартфон стал не только быстрее, по сравнению с iPhone XS Max, но и его фотографические возможности вышли на иной уровень. 
Теперь в смартфоне 3 камеры, которые покрывают основные фокусные расстояния. 
Это будет полезным как для фото, так и видео, благо в iPhone 11 Pro Max есть функция оптической стабилизации.

