Xiaomi Redmi 8 - смартфон, элегантно объединивший в себе необычные цвета корпуса, безрамочное исполнение, неплохое оснащение, 
большой экран и сравнительно доступную стоимость. 6,22-дюймлвый дисплей устройства выполнен по технологии IPS, 
а его разрешение составляет 1520х720 точек. В качестве центрального процессора в Xiaomi Redmi 8 
используется 8-ядерный Qualcomm Snapdragon 439. 
В зависимости от конфигурации в оперативной памяти может быть установлено 3 или 4 ГБ. 
Для хранения данных устанавливается накопитель на 32 или 64 ГБ соответственно. 
Основная камера смартфона состоит из модуля на 12 МП и сенсора глубины на 2 МП, Фронтальная же оснащается 8 МП модулем. 
Xiaomi Redmi 8 оснащается емким аккумулятором на 5000 мАч, который, при этом, поддерживает еще и быструю зарядку.