Xiaomi Redmi Note 8 Pro – продвинутая версия среднеуровневого смартфона в линейке компании. 
Устройство получило экстравагантный дизайн, сочетающий безрамочное исполнение и яркие цвета с переливами. 
В отличии от стандартной модели Xiaomi Redmi Note 8 Pro получила экран большей диагонали — 6,5-дюймов. 
Тип матрицы — IPS, а разрешение 2340х1080 точек. В качестве аппаратной платформы используется 8-ядерное решение Helio G90T 
с исполнением 2+6. Основная камера состоит из четырех модулей на 64, 8 и пары на 2 МП. 
Фронтальная камера оснащается сенсором на 20 МП. Помимо этого, Xiaomi Redmi Note 8 Pro дополнен NFC.