iPhone 11 нельзя назвать абсолютно новым смартфоном, это прямой потомок iPhone XR.
Смартфон изменился внешне очень минимально, габариты с предшественником совпадают полностью. 
Главным внешним новшеством являются обновленные цветовые решения, но это по-прежнему самый яркий iPhone. 
Еще одним изменением стало появление второго модуля камеры, теперь к широкоугольному добавился ультраширокоугольный объектив. 
Это позволит создавать групповые портреты и красивые панорамы. 
В качестве процессора теперь используется более быстрый и энергоэффективный Apple 13 Bionic. 
Что касается времени автономной работы, то и здесь компания сделала шаг вперед и смартфон должен работать 
как минимум на час дольше модели XR.

