"Это будущее на ближайшие 10 лет" - так представил юбилейную, десятую версию iPhone, Тим Кук, руководитель Apple. 
iPhone X вобрал в себя самые интересные и необычные наработки компании. 
В первую очередь это касается внешнего вида смартфона. Безрамочный дисплей со скругленными углами, которым оснащен смартфон, - 
это не уникальная особенность, но теперь мы увидим много таких смартфонов в ближайшем будущем. На момент выхода, дисплей iPhone X - 
это один из лучших дисплеев в смартфонах по своими характеристикам. Он обладает контрастностью 1000000:1, 
поддерживает технологии HDR и True Tone для адаптации цветовой гаммы к освещению. 
Во-вторых, как и предыдущая модель - iPhone 7, "десятка" тоже лишилась некоторых привычных деталей. 
Не стало кнопки Home и сканера отпечатка пальцев. Если для навигации Apple реализовала жесты в операционной системе, 
то для обеспечения безопасности пользовательских данных теперь используется инфракрасный сканер лица, 
который не просто реагирует на форму лица, но и на разные его особенности, 
а также возрастные изменения и более мелкие детали - например макияж или наличие бороды. 
В этом смартфону помогает сопроцессор, поддерживающий машинное обучение. 
Поддержка распознавания лица заложена и в развлекательные функции, 
к примеру на основе своего лица вы можете делать анимированные Emoji, которые называются Animoji. 
Еще одной фишкой iPhone X является поддержка дополненной реальности за счет процессора Apple A11 Bionic и пары основных камер.

