Samsung Galaxy A51 2020 – элегантный смартфон, сочетающий экстравагантный дизайн, 
необычные цвета корпуса и высокий уровень технического оснащения. 
Он получил полностью безрамочное исполнение, а 6,5-дюймовый Super AMOLED дисплей занимает практически всю лицевую поверхность. 
Фронтальная камера на 32 МП Samsung Galaxy A51 2020 спрятана в миниатюрном вырезе в самом экране. 
Дополнительно в него встроен еще и сканер отпечатков пальцев. 
В качестве аппаратной платформы используется фирменное 8-ядерное решение компании Exynos 9611, 
дополненное графическим ускорителем Mali-G72 MP3. 
Основная камера смартфона состоит из четырех модулей: 48 МП, 12 МП и пары по 5 МП. 
Они позволяют вести запись видео в разрешении 3840х2160 точек с частотой 60 к/с, замедленную съемку с частотой 240 кадров, 
а также делать фотопортреты с эффектом Боке. Дополнительно Samsung Galaxy A51 2020 оснащается модулем NFC, 
а также поддерживает быструю зарядку на 15 Вт.
