Galaxy S10e занимает начальное положение в линейке флагманов 2019 года от Samsung. 
Среди трех основных смартфонов под названием S10, этот - самый компактный, 
но в остальном столь же мощный и почти также неплохо умеет фотографировать. 
Самым заметным отличием является уменьшенная до 5,8 дюймов диагональ дисплея и чуть более широкие рамки, 
чем в старшем Galaxy S10. Разрешение экрана тоже меньше, но незначительно. Внутри смартфона столь же быстрый, 
как и других флагманов, процессор Exynos 9820. В начальной модификации Galaxy S10 оснащен "всего" 6 ГБ оперативной памяти и 
128 ГБ постоянной памяти. Этот объем можно расширить за счет карт памяти. 
Вторым заметным отличием от более дорогих моделей является две основные камеры, вместо трех. 
Основной блок состоит из светосильной камеры с изменяемой диафрагмой от f/1.5 до f/2.4, а также широкоугольного модуля. 
Объем аккумулятора самый скромный - 3100 мАч, против 3400 у Galaxy S10 и 4100 у S10+.