Xiaomi Redmi Note 8T – смартфон среднего уровня, ориентированный на тех пользователей, 
которые ищут сбалансированное устройство для комфортного повседневного использования. 
Он выполнен в элегантном корпусе с минимальными рамками и эффектными вариантами цветов. 
Xiaomi Redmi Note 8T оснащается 6,3-дюймовым IPS дисплеем с разрешением 2340х1080 точек. 
Хорошую производительность обеспечивает платформа Qualcomm Snapdragon 665, дополненная видеочипом Adreno 610. 
Оперативной памяти может быть установлено 3 или 4 ГБ, а для хранения данных от 32 до 128 ГБ. 
Основная камера состоит из 4-х модулей. Главного на 48 МП с широким углом, ульраширокоугольного 8 МП, 2МП макро и 2 МП сенсора глубины. 
Дополнительно Xiaomi Redmi Note 8T оснащается модулем NFC и поддерживает быструю зарядку на 18W.